# IFC_DefPsetImport

## Description
Imports Custom Object Presets from XML, XLSX, CSV or text files from folder.

```pascal
FUNCTION IFC_DefPsetImport(strFilePath : STRING) : BOOLEAN;
```

```python

def vs.IFC_DefPsetImport(strFilePath):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strFilePath|STRING||

## Version
Availability: from Vectorworks 2016
## Category
* IFC